//IUCSDUP JOB (FB3),'DFHCSDUP',CLASS=A,MSGCLASS=H,
//       NOTIFY=&SYSUID,REGION=0M,TIME=1440
//*      TYPRUN=HOLD
//STEP1   EXEC PGM=DFHCSDUP,REGION=0M,
//             PARM='CSD(READWRITE),PAGESIZE(60),NOCOMPAT'
//STEPLIB DD   DSN=DFH560.CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD  DISP=SHR,DSN=DFH560.CICS.DFHCSD
//*ECNDCSD DD  DISP=SHR,DSN=DFH560.CICS.SECNDCSD
//OUTDD    DD  SYSOUT=A
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  *
  DEFINE FILE(EXMPCAT) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Catalog File)
       DSNAME(IBMUSER.EXMPLAPP.EXMPCAT)
       LSRPOOLNUM(1) RLSACCESS(NO)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(21/07/14 16:41:38)
  DEFINE FILE(EXMPCONF) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Configuration File)
       DSNAME(IBMUSER.EXMPLAPP.EXMPCONF)
       RLSACCESS(NO) LSRPOOLNUM(1)
       READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(1)
       STATUS(ENABLED) OPENTIME(FIRSTREF) DISPOSITION(SHARE)
       DATABUFFERS(2) INDEXBUFFERS(1) TABLE(NO) MAXNUMRECS(NOLIMIT)
       UPDATEMODEL(LOCKING) LOAD(NO) RECORDFORMAT(V) ADD(YES)
       BROWSE(YES) DELETE(YES) READ(YES) UPDATE(YES) JOURNAL(NO)
       JNLREAD(NONE) JNLSYNCREAD(NO) JNLUPDATE(NO) JNLADD(NONE)
       JNLSYNCWRITE(YES) RECOVERY(NONE) FWDRECOVLOG(NO)
       BACKUPTYPE(STATIC) DEFINETIME(21/07/14 16:41:38)
  DEFINE MAPSET(DFH0XS1) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - mapset for EXMENU/EXORDR)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
       DEFINETIME(21/07/14 16:41:38) CHANGETIME(21/07/14 16:41:38)
  DEFINE MAPSET(DFH0XS2) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - mapset for EXINQC)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
       DEFINETIME(21/07/14 16:41:38) CHANGETIME(21/07/14 16:41:38)
  DEFINE MAPSET(DFH0XS3) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - mapset for EXCONF)
       RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
       DEFINETIME(21/07/14 16:41:38) CHANGETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XCFG) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Configuration Program)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XCMN) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Catalog Manager)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XGUI) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - BMS Front End Program)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XODE) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Order dispatch Endpoint)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XSDS) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Dummy data handler)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XSOD) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Dummy dispatch manager)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XSSM) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Dummy stock manager)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XVDS) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - VSAM data handler)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE PROGRAM(DFH0XWOD) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Dispatch manager)
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)
       EXECKEY(USER) CONCURRENCY(THREADSAFE) API(CICSAPI) DYNAMIC(NO)
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(21/07/14 16:41:38)
  DEFINE TRANSACTION(ECFG) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - Configuration)
       PROGRAM(DFH0XCFG) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
  DEFINE TRANSACTION(EGUI) GROUP(ZOFFICE)
  DESCRIPTION(CICS Example Application - BMS Front End)
       PROGRAM(DFH0XGUI) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)
       RESTART(NO) SPURGE(YES) TPURGE(NO) DUMP(YES) TRACE(YES)
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
/*
